cask_args appdir: '/Applications'

brew 'postgresql@18'
brew 'redis'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'wget'
brew 'coreutils'
brew 'eza'
brew 'bat'
brew 'ripgrep'
brew 'fd'
brew 'fzf'
brew 'just'
brew 'direnv'
brew 'zoxide'

brew 'mackup'
brew 'node'
brew 'python'
brew 'gzip'
brew 'jq'
brew 'yq'
brew 'ca-certificates'
brew 'uv'
brew 'uvwasi'
brew 'gnutls'
brew 'gnupg'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'sevenzip'
brew 'awscli'
brew 'fontconfig'
brew 'gnu-sed'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'k6'
brew 'kubernetes-cli'
brew 'sqlite'
brew 'go'
brew 'golangci-lint'
brew 'delve'
brew 'sqlc'
brew 'pgcli'
brew 'ollama'
brew 'ffmpeg'
brew 'imagemagick'
brew 'cmake'

cask 'font-caskaydia-mono-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-symbols-only-nerd-font'
cask 'font-fira-code'

cask 'visual-studio-code'
cask 'spotify'
cask 'discord'
cask 'raycast'
cask 'alt-tab'
cask '1password-cli'
cask '1password'
cask 'warp'
cask 'steam'
cask 'cursor'
cask 'whatsapp'
cask 'signal'
cask 'google-chrome'
cask 'firefox'
cask 'telegram'
cask 'orbstack'
cask 'chatgpt'
cask 'claude'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'redis-insight'
cask 'ngrok'
cask 'slack'
cask 'zoom'
cask 'bambu-studio'
cask 'deepchat'
cask 'figma'
cask 'gitkraken'
cask 'granola'
cask 'lens'




brew 'perl'
brew 'cpanminus'

# brew 'dnsenum'                    # Install via tap: brew tap b-ramsey/homebrew-kali && brew install --HEAD dnsenum
brew 'nmap'
brew 'masscan'
brew 'rustscan'
brew 'amass'
brew 'subfinder'
brew 'nuclei'
brew 'fierce'
# brew 'autorecon'                 # Install via pipx: pipx install git+https://github.com/Tib3rius/AutoRecon.git
brew 'theharvester'
# brew 'responder'                 # Best used in Linux VM - unreliable on macOS
# brew 'netexec'                  # Not available via Homebrew; install via pipx or upstream
# brew 'enum4linux-ng'             # Install via pipx: pipx install git+https://github.com/cddmp/enum4linux-ng.git

brew 'gobuster'
brew 'feroxbuster'
# brew 'dirsearch'                 # Install via pipx: pipx install dirsearch
brew 'ffuf'
# brew 'dirb'                      # Install via tap: brew tap b-ramsey/homebrew-kali && brew install --HEAD dirb
brew 'httpx'
brew 'katana'
brew 'nikto'
brew 'sqlmap'
# brew 'wpscan'                   # Install via gem: gem install --user-install wpscan
brew 'arjun'
# brew 'paramspider'               # Install via pipx: pipx install git+https://github.com/devanshbatham/ParamSpider.git
brew 'dalfox'
# brew 'wafw00f'                   # Install via pipx: pipx install wafw00f

brew 'hydra'
brew 'john'
brew 'hashcat'
brew 'medusa'
# brew 'patator'                   # Install via pipx: pipx install patator (needs mysql-client)
# brew 'crackmapexec'              # Install via pipx: pipx install git+https://github.com/byt3bl33d3r/CrackMapExec.git
# brew 'evil-winrm'                # Install via gem: gem install --user-install evil-winrm
# brew 'hash-identifier'           # Replaced by hashid - Install via pipx: pipx install hashid
brew 'ophcrack'

# brew 'nmap-parse-output'          # Manual install: git clone + symlink (needs libxslt)

brew 'gdb'
brew 'radare2'
brew 'binwalk'
# Install via cask
# brew 'checksec'                  # Install via go: go install github.com/slimm609/checksec@latest
# System tools available - use binutils for GNU versions
brew 'binutils'                   # Provides gstrings, gobjdump (GNU versions)
brew 'llvm'                       # Provides llvm-objdump and other LLVM tools

# brew 'volatility3'               # Install via pipx: pipx install volatility3
brew 'foremost'
# brew 'steghide'                 # Not available on Apple Silicon; build from source
brew 'exiftool'

# Additional required dependencies for various tools
brew 'mysql-client'               # Required for patator MySQL modules
brew 'samba'                      # Required for enum4linux-ng (provides smbclient/rpcclient)
brew 'libxslt'                    # Required for nmap-parse-output (provides xsltproc)
brew 'pkg-config'                 # Build dependency for various tools
brew 'autoconf'                   # Build dependency
brew 'automake'                   # Build dependency
brew 'libtool'                    # Build dependency
brew 'sqlcipher'                  # Required for patator's pysqlcipher3 module
brew 'ruby'                       # Provides modern Ruby for evil-winrm gem

# GUI Applications
cask 'ghidra'                     # Reverse engineering suite (requires Java)
