cask_args appdir: '/Applications'

brew 'postgresql@18'
brew 'redis'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'wget'
brew 'coreutils'
brew 'eza'
brew 'bat'
brew 'ripgrep'
brew 'fd'
brew 'fzf'
brew 'just'
brew 'direnv'
brew 'zoxide'

brew 'mackup'
brew 'node'
brew 'python'
brew 'gzip'
brew 'jq'
brew 'yq'
brew 'ca-certificates'
brew 'uv'
brew 'uvwasi'
brew 'gnutls'
brew 'gnupg'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'sevenzip'
brew 'awscli'
brew 'fontconfig'
brew 'gnu-sed'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'k6'
brew 'kubernetes-cli'
brew 'sqlite'
brew 'go'
brew 'golangci-lint'
brew 'delve'
brew 'sqlc'
brew 'pgcli'
brew 'ollama'
brew 'ffmpeg'
brew 'imagemagick'

cask 'font-caskaydia-mono-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-symbols-only-nerd-font'
cask 'font-fira-code'

cask 'visual-studio-code'
cask 'spotify'
cask 'discord'
cask 'raycast'
cask 'alt-tab'
cask '1password-cli'
cask '1password'
cask 'warp'
cask 'steam'
cask 'cursor'
cask 'whatsapp'
cask 'signal'
cask 'google-chrome'
cask 'firefox'
cask 'telegram'
cask 'orbstack'
cask 'chatgpt'
cask 'claude'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'redisinsight'
cask 'ngrok'
cask 'slack'
cask 'zoom'
cask 'bambu-studio'
cask 'deepchat'
cask 'figma'
cask 'gitkraken'
cask 'granola'
cask 'lens'
