anthropic.claude-code
bierner.markdown-mermaid
esbenp.prettier-vscode
github.github-vscode-theme
golang.go
grapecity.gc-excelviewer
inferrinizzard.prettier-sql-vscode
mads-hartmann.bash-ide-vscode
mechatroner.rainbow-csv
naumovs.color-highlight
oderwat.indent-rainbow
pkief.material-icon-theme
redhat.vscode-yaml
sleistner.vscode-fileutils
subframe7536.custom-ui-style
bradlc.vscode-tailwindcss
kisstkondoros.vscode-codemetrics
ryanluker.vscode-coverage-gutters
formulahendry.auto-rename-tag
wix.vscode-import-cost
johnpapa.vscode-peacock
1Password.op-vscode
formulahendry.auto-close-tag
biomejs.biome
oven.bun-vscode
openai.chatgpt
rphlmr.vscode-drizzle-orm
ms-ossdata.vscode-pgsql
rangav.vscode-thunder-client